In [1]:
import pandas as pd

print('Версия pandas:', pd.__version__)

Версия pandas: 2.1.4

# Удаление строк и столбцов из структуры DataFrame

# Метод drop()

    План урока

    1. Удаление строк из DataFrame
    
    - Удаление по имени строки (по метке)
    - Удаление по номеру строки
    - Если индекс не задан
    
    2. Удаление столбцов из DataFrame
    
    - Удаление по имени столбца (по метке)
    - Удаление по номеру столбца
    
    3. Удаление нескольких строк и столбцов одновременно

In [2]:
df = pd.read_csv('files/sample_1.csv', index_col=0)
df

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

# 1. Удаление строк из DataFrame

## Удаление по имени строки (по метке - label)

In [3]:
# необходимо указать имя строки в первом аргументе labels
# аргумент axis по умолчанию стоит в позиции 0

display(df.drop('Charlie', axis=0),
        
        df.drop('Charlie'))

       age state  point
name
Alice   24    NY     64
Bob     42    CA     92
Dave    68    TX     70
Ellen   24    CA     88
Frank   30    NY     57

       age state  point
name
Alice   24    NY     64
Bob     42    CA     92
Dave    68    TX     70
Ellen   24    CA     88
Frank   30    NY     57

In [4]:
# удаление строки с использованием аргумента index

df.drop(index='Charlie')

       age state  point
name
Alice   24    NY     64
Bob     42    CA     92
Dave    68    TX     70
Ellen   24    CA     88
Frank   30    NY     57

In [5]:
# используем список, в который помещаем все метки строк под удаление

display(df.drop(['Bob', 'Dave', 'Frank']),
        
        df.drop(index=['Bob', 'Dave', 'Frank']))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Ellen     24    CA     88

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Ellen     24    CA     88

In [6]:
df_1 = df.copy()
# если аргумент inplace=True, изменяется исходная структура DataFrame и ничего не возвращается (None):

print(df_1.drop(index=['Bob', 'Dave', 'Frank'], inplace=True))

None

In [7]:
# строк с метками 'Bob', 'Dave', 'Frank' блольше нет в структуре df_1
df_1

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Ellen     24    CA     88

In [8]:
df_2 = pd.read_csv('files/sample_1.csv', index_col=0)
df_2

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [9]:
df_add = pd.DataFrame({'age': [20, 18, 25], 'state': ['NY','TX','CA'], 'point':[80, 76, 89]}, 
                      index=['Ellen', 'George', 'Dave'])
df_add

        age state  point
Ellen    20    NY     80
George   18    TX     76
Dave     25    CA     89

In [10]:
df_new=pd.concat([df_2, df_add])
df_new

         age state  point
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57
Ellen     20    NY     80
George    18    TX     76
Dave      25    CA     89

In [11]:
# удаляются все строчки с метками 'Dave' и 'Ellen'

df_new.drop(['Dave', 'Ellen'])

         age state  point
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Frank     30    NY     57
George    18    TX     76

In [12]:
# Обнаружить дубликаты помогает метод duplicated()
# метод duplicated() возвращает булев массив
# с помощью метода sum() можно подсчитать количество дубликатов

print(df_new.index.duplicated(),
      'Количество дубликатов:', df_new.index.duplicated().sum(), sep='\n\n')

[False False False False False False  True False  True]

Количество дубликатов:

2

## Удаление по номеру строки

In [13]:
df

         age state  point
name
Alice     24    NY     64
Bob       42    CA     92
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [14]:
df.index[1]

'Bob'

In [15]:
df.index[[1, 3, 5]]

Index(['Bob', 'Dave', 'Frank'], dtype='object', name='name')

In [16]:
# мы можем использовать атрибут index в качестве первого аргумента labels или в качестве аргумента index метода drop()

display(df.drop(df.index[[1, 3, 5]]),
        df.drop(index=df.index[[1, 3, 5]]))

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Ellen     24    CA     88

         age state  point
name
Alice     24    NY     64
Charlie   18    CA     70
Ellen     24    CA     88

## Если индекс не задан

In [17]:
df_no_index = pd.read_csv('files/sample_1.csv')

display(df_no_index)

print('Индексы структуры df_no_index:', df_no_index.index)

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

Индексы структуры df_no_index: RangeIndex(start=0, stop=6, step=1)

In [18]:
# В данном примере прямое указание номеров строк при удалении дает тот же результат, что и использование атрибута index.

display(df_no_index.drop([1, 3, 5]))

display(df_no_index.drop(df_no_index.index[[1, 3, 5]]))

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

      name  age state  point
0    Alice   24    NY     64
2  Charlie   18    CA     70
4    Ellen   24    CA     88

In [19]:
# Результат будет отличаться, если последовательность нарушена такими действиями, как сортировка (sort_values('state'))

df_no_index_sort = df_no_index.sort_values('state')
display(df_no_index_sort)

display(df_no_index_sort.index)

      name  age state  point
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88
0    Alice   24    NY     64
5    Frank   30    NY     57
3     Dave   68    TX     70

Index([1, 2, 4, 0, 5, 3], dtype='int64')

In [20]:
# При прямом указании числа удаляется строка с этим числом в качестве метки

display(df_no_index_sort.drop([1, 3, 5]))

display(df_no_index_sort.drop(df_no_index_sort.index[[1, 3, 5]]))

      name  age state  point
2  Charlie   18    CA     70
4    Ellen   24    CA     88
0    Alice   24    NY     64

    name  age state  point
1    Bob   42    CA     92
4  Ellen   24    CA     88
5  Frank   30    NY     57

# 2. Удаление столбцов из DataFrame

## Удаление по имени столбца (по метке)

In [21]:
df.drop('state', axis=1)

         age  point
name
Alice     24     64
Bob       42     92
Charlie   18     70
Dave      68     70
Ellen     24     88
Frank     30     57

In [22]:
df.drop(columns='state')

         age  point
name
Alice     24     64
Bob       42     92
Charlie   18     70
Dave      68     70
Ellen     24     88
Frank     30     57

In [23]:
display(df.drop(['state', 'point'], axis=1),
        df.drop(columns=['state', 'point']))

         age
name
Alice     24
Bob       42
Charlie   18
Dave      68
Ellen     24
Frank     30

         age
name
Alice     24
Bob       42
Charlie   18
Dave      68
Ellen     24
Frank     30

## Удаление по номеру столбца

In [24]:
display(df.columns[[1, 2]])

# используем атрибут columns структуры DataFrame

display(df.drop(df.columns[[1, 2]], axis=1),
        
        df.drop(columns=df.columns[[1, 2]]))

Index(['state', 'point'], dtype='object')

         age
name
Alice     24
Bob       42
Charlie   18
Dave      68
Ellen     24
Frank     30

         age
name
Alice     24
Bob       42
Charlie   18
Dave      68
Ellen     24
Frank     30

## Одновременное удаление нескольких строк и столбцов

In [25]:
# используем одновременно аргументы index и columns

df.drop(index=['Bob', 'Dave', 'Frank'], columns=['state', 'point'])

         age
name
Alice     24
Charlie   18
Ellen     24

In [26]:
# используем одновременно аргументы index и columns + атрибуты index и columns

df.drop(index=df.index[[1, 3, 5]], columns=df.columns[[1, 2]])

         age
name
Alice     24
Charlie   18
Ellen     24

In [27]:
df_copy = df.copy()

df_copy.drop(index=['Bob', 'Dave', 'Frank'], columns=['state', 'point'],
             inplace=True)
df_copy

         age
name
Alice     24
Charlie   18
Ellen     24